Revit 2026 API

# Transform1D(Transform1D) Constructor

---

The copy constructor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform1D(
	Transform1D other
)
```
```vb
Public Sub New (
	other As Transform1D
)
```
```cpp
public:
Transform1D(
	Transform1D^ other
)
```
```fsharp
new :
        other : Transform1D -> Transform1D
```

#### Parameters

other Transform1D
     The transformation to use as input.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Transform1D Class

Transform1D Overload

Autodesk.Revit.DB Namespace